{
  "note": "this list was generated by chatgpt and i did not have time to go through all of this. please use carefully",
  "superAdminNotes": [
    ["CRM Enhancements", "Request to add a 'Lead Source' filter in reports for better tracking."],
    [
      "Bug Reports",
      "Issue with lead status update not reflecting for all users—reported to dev team."
    ],
    [
      "Workflow Improvements",
      "Automate lead reassignment for inactive reps after 7 days of no activity."
    ]
  ],
  "clientAdminNotes": [
    [
      "Lead Progress Updates",
      "Lead [Lead Name] requested a proposal—[Sales Rep Name] to send it by March 22."
    ],
    [
      "Client Concerns & Needs",
      "Lead prefers a monthly billing option—check with finance for feasibility."
    ],
    ["Follow-Ups & Deadlines", "Follow-up email to be sent by [Sales Rep Name] on March 20."],
    ["Sales Rep Performance Tracking", "[Sales Rep Name] closed 5 deals this month—top performer!"],
    ["Pending Tasks & Reminders", "Update lead status weekly to avoid stale leads."],
    [
      "Escalations & Issues",
      "Lead complained about delayed response—review response time metrics."
    ],
    [
      "Workflow Improvements",
      "Need a structured process for lead re-engagement—set up automated email sequences."
    ],
    [
      "Internal Communication Notes",
      "Ensure marketing team shares updated lead lists with sales weekly."
    ]
  ],
  "managerNotes": [
    ["Lead Assignment", "Reassign stale leads older than 14 days to active reps."],
    [
      "Lead Follow-Up",
      "Ensure all high-priority leads have a follow-up scheduled within 48 hours."
    ],
    [
      "Lead Qualification",
      "Verify that all leads in 'Negotiation' stage have been properly qualified."
    ],
    ["Deal Closure", "Track deals in final stages and assist reps in closing high-value leads."],
    [
      "Performance Tracking",
      "Review monthly conversion rates for each sales rep and discuss improvements."
    ],
    ["Sales Strategy", "Encourage reps to cross-sell and upsell where applicable."],
    [
      "Pipeline Management",
      "Ensure all reps update pipeline status weekly to maintain data accuracy."
    ],
    [
      "KPI Monitoring",
      "Monitor key performance indicators such as response time and conversion rates."
    ],
    [
      "Escalation Handling",
      "Handle client escalations promptly and ensure resolution within 24 hours."
    ],
    ["Training & Development", "Schedule training for underperforming reps on objection handling."],
    ["Client Communication", "Encourage reps to personalize outreach to improve engagement rates."],
    [
      "Collaboration with Marketing",
      "Align sales and marketing efforts for lead nurturing campaigns."
    ],
    ["Meeting Notes", "Weekly team meeting scheduled for performance review and goal setting."],
    ["Sales Targets", "Ensure each rep meets their monthly sales quota."],
    [
      "Lead Prioritization",
      "Focus on high-value leads and follow up on warm prospects immediately."
    ],
    ["Process Improvement", "Optimize CRM workflow for smoother lead tracking and follow-ups."],
    ["Report Analysis", "Analyze lost deal reports to identify common objections."],
    ["Incentives & Motivation", "Review commission structure to boost rep motivation."],
    ["Customer Feedback", "Collect feedback from closed deals to improve the sales process."],
    ["Data Accuracy", "Check for duplicate leads and clean up the CRM data monthly."]
  ],
  "salesRepNotes": [
    ["Lead Contact", "Called Emily Carter, no answer. Scheduled a callback for tomorrow."],
    ["Follow-Up", "Sent follow-up email to Jason Mitchell after demo, waiting for response."],
    ["Lead Nurturing", "Shared a case study with Rachel Thompson to build trust."],
    [
      "Objection Handling",
      "Michael Anderson is concerned about pricing; offered a discount for annual subscription."
    ],
    ["Demo Scheduling", "Scheduled product demo for Sophia Ramirez on March 25 at 2 PM."],
    [
      "Lead Qualification",
      "Confirmed that David Johnson has the budget and authority to make purchase decisions."
    ],
    ["Proposal Sent", "Sent pricing proposal to Olivia Scott, follow-up scheduled for next week."],
    [
      "Closing Strategy",
      "Liam Martinez is 80% ready to buy; offered a limited-time discount to close the deal."
    ],
    [
      "Meeting Recap",
      "Had a call with Noah Walker, interested in specific features, sending more details."
    ],
    [
      "Lead Interest",
      "Ethan Lewis engaged with our email but hasn't responded. Sending a follow-up message."
    ],
    ["CRM Update", "Updated lead status from 'Interested' to 'Negotiation' for Charlotte Hall."],
    [
      "Lead Priority",
      "High-priority lead, Benjamin White. Ensure daily touchpoints until deal closes."
    ],
    [
      "Referral Opportunity",
      "Ava Hernandez mentioned a colleague might be interested; following up on referral."
    ],
    [
      "Customer Pain Points",
      "Lucas Green struggles with manual processes, emphasized automation benefits."
    ],
    [
      "Industry Insights",
      "Mia Nelson is in manufacturing; shared industry-specific success stories."
    ],
    [
      "Competitor Comparison",
      "Harper Baker mentioned a competitor; provided a comparison chart highlighting our advantages."
    ],
    [
      "Urgency Creation",
      "Used a time-limited offer with Emma Adams to encourage quicker decision-making."
    ],
    [
      "Churn Risk",
      "Existing client Daniel Gonzalez is considering cancellation; scheduled a retention call."
    ],
    ["Upsell Opportunity", "Elijah Young is interested in upgrading to a premium package."],
    [
      "Cross-Sell Attempt",
      "Madison Carter already using one product; introduced complementary solution."
    ],
    [
      "Cold Lead Revival",
      "Reached out to inactive lead Henry Rodriguez from last quarter; interested in reconnecting."
    ],
    [
      "Trial Expiry Reminder",
      "Notified Isabella King that her free trial ends in 3 days; offered a discount to convert."
    ],
    [
      "Decision Maker Engagement",
      "Connected with decision-maker Alexander Wright rather than just a mid-level contact."
    ],
    ["Lead Budget", "Scarlett Hill has limited budget; presented flexible payment options."],
    ["Pain Point Alignment", "Owen Lopez wants to reduce costs; highlighted cost-saving features."],
    [
      "Final Negotiation",
      "Lily Harris is asking for final adjustments; coordinating with finance."
    ],
    ["Contract Sent", "Sent contract to William Clark for e-signature, waiting for approval."],
    ["Lead Ghosting", "Jack Torres stopped responding; trying a new communication channel."],
    [
      "Lead Research",
      "Checked Amelia Collins' LinkedIn profile for insights before the next call."
    ],
    [
      "Product Fit Confirmation",
      "Confirmed that Elijah Cooper's needs align with our core offering."
    ],
    [
      "Pricing Discussion",
      "Sofia Richardson requested custom pricing; escalated to management for approval."
    ],
    [
      "Customer Success Introduction",
      "Introduced lead Jacob Stewart to customer success team for onboarding support."
    ],
    ["Networking Follow-Up", "Met Ethan Morris at an event; sent a follow-up message."],
    [
      "Renewal Reminder",
      "Client Abigail Reed's subscription renews in a month; checking for upsell opportunities."
    ],
    [
      "Lead Source Tracking",
      "Lead Nathan Bennett came from webinar; following up with webinar-specific messaging."
    ],
    [
      "Reconnection Attempt",
      "Old lead Victoria Parker re-engaged after 6 months; started fresh conversation."
    ],
    [
      "Meeting Preparation",
      "Prepared talking points for tomorrow's sales call with Gabriel Flores."
    ],
    [
      "Lead Sentiment",
      "Grace Rivera excited about features but unsure about implementation timeline."
    ],
    ["Delayed Decision", "James Brooks wants to wait until next quarter; added to follow-up list."],
    [
      "Objection Response",
      "Natalie Sanders concerned about integration; provided a tech support demo."
    ],
    ["Proposal Revision", "Updated proposal for Christopher Powell based on feedback."],
    [
      "Deal Loss Analysis",
      "Michael Bryant went with a competitor; noted reasons for future improvement."
    ],
    ["Lead Activation", "Encouraged trial user Hannah Foster to fully explore features."],
    [
      "High-Touch Engagement",
      "Lead Jonathan Russell requires frequent updates; scheduling weekly check-ins."
    ],
    [
      "Lead Behavior",
      "Victoria Jenkins clicked on pricing page multiple times; reached out proactively."
    ],
    [
      "Time Zone Adjustment",
      "Scheduled call at Olivia Griffin's local time to improve attendance rate."
    ],
    [
      "Personalized Outreach",
      "Used Lucas Perry's company news in email to personalize conversation."
    ],
    ["Social Proof", "Sent testimonial video to Samantha Coleman to build lead confidence."],
    [
      "Customer Objections",
      "Ryan Patterson skeptical about ROI; shared case study with proven results."
    ],
    ["Final Follow-Up", "Sent last email to Elijah Sanders before marking lead as lost."],
    [
      "Live Chat Engagement",
      "Matthew Simmons interacted with chatbot; initiated direct conversation."
    ],
    ["Product Update Sharing", "Notified Sophia Evans about a new feature launch."],
    [
      "Multi-Touch Follow-Up",
      "Reached out to Jackson Parker via email, LinkedIn, and phone for better response."
    ],
    [
      "Referral Program Mention",
      "Informed Madison Bailey about referral program for additional incentives."
    ],
    ["Video Outreach", "Sent a short personalized video to Henry Murphy instead of plain email."],
    [
      "Lead Sentiment Tracking",
      "Lead Elijah Martinez hesitant, needs more reassurance before committing."
    ],
    ["Trial User Conversion", "Encouraging Emma Rogers to switch from free trial to a paid plan."],
    [
      "VIP Treatment",
      "High-value lead Daniel Reed, offering white-glove service to close the deal."
    ],
    [
      "Contract Negotiation",
      "Charlotte Cooper requested contract modifications; reviewing with legal."
    ],
    ["Urgency Strategy", "Emphasized limited stock availability to Jack Bennett to drive urgency."],
    [
      "Value Reinforcement",
      "Repeated key benefits to Olivia Rivera to reinforce value perception."
    ],
    [
      "Lost Deal Recovery",
      "Following up with past lost deal Nathan Mitchell to check if circumstances have changed."
    ],
    [
      "Customer Success Story Sharing",
      "Sent Harper Torres a success story similar to their business case."
    ],
    ["Targeted Offer", "Created a personalized discount for Ava Brooks based on her industry."],
    ["Internal Handoff", "Transferred Jacob Scott to onboarding team after successful sale."],
    [
      "Competitor Takeover",
      "Lead Lily King currently using a competitor; offered a migration plan."
    ],
    [
      "Customer Support Coordination",
      "Ensured Ethan Adams' tech concerns were addressed by the support team."
    ],
    ["Special Deal Approval", "Requested manager approval for custom pricing for Noah Lewis."],
    [
      "Lead Touchpoint Strategy",
      "Mapped out a touchpoint strategy for high-value lead Amelia Thompson."
    ],
    ["Sales Rep Reflection", "Reviewed personal sales performance for improvement."],
    [
      "Lead Clarity Confirmation",
      "Reconfirmed Charlotte Anderson's needs before presenting a proposal."
    ],
    ["End-of-Month Push", "Focused on closing as many deals as possible before month-end."],
    ["CRM Data Entry", "Logged all call notes and updates in CRM for accurate tracking."]
  ]
}
